brew "just"
brew "opencode"
brew "tmux"
brew "uv"
cask "bitwarden"
cask "brave-browser"
cask "google-chrome"
cask "iterm2"
cask "obsidian"
cask "visual-studio-code"
vscode "charliermarsh.ruff"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "pkief.material-icon-theme"
vscode "whizkydee.material-palenight-theme"
