# Tier 1
# Open-source code editor
cask "visual-studio-code"
vscode "charliermarsh.ruff"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "pkief.material-icon-theme"
vscode "whizkydee.material-palenight-theme"

# Control your tools with a few keystrokes
cask "raycast"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Font
cask "font-jetbrains-mono-nerd-font"
# Prompt theme engine for any shell
brew "oh-my-posh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Handy way to save and run project-specific commands
brew "just"
# Web browser focusing on privacy
cask "brave-browser"


# Tier 2
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Application uninstaller
cask "appcleaner"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Official tldr client written in Rust
brew "tlrc"
# Shell extension to navigate your filesystem faster
brew "zoxide"


# Tier 3
# Replacement for Docker Desktop
cask "orbstack"
# GitHub command-line tool
brew "gh"
# Display directories as trees (with optional color/HTML output)
brew "tree"

